{
  "recipe001": {
    "categoryId": "1",
    "recipeId": "1",
    "categoryName": "breakfast",
    "name": "Banana-Bran Muffins",
    "description": "By the end of the week, any bananas left in the fruit bowl are past their prime--just right for these moist bran muffins. Add a handful of dark chocolate chips to entice children to enjoy a fiber-rich treat.",
    "ingredients": [
      "2 large eggs", 
      "⅔ cup packed light brown sugar", 
      "1 cup mashed ripe bananas (2 medium)", 
      "1 cup buttermilk", 
      "1 cup unprocessed wheat bran", 
      "¼ cup canola oil", 
      "1 teaspoon vanilla extract", 
      "1 cup whole-wheat flour", 
      "¾ cup all-purpose flour", 
      "1 ½ teaspoons baking powder", 
      "½ teaspoon baking soda", 
      "½ teaspoon ground cinnamon", 
      "¼ teaspoon salt", 
      "½ cup 1/2 cup chocolate chips, (optional)", 
      "⅓ cup 1/3 cup chopped walnuts, (optional)"
    ],
    "instructions": {
      "1": "Preheat oven to 400 degrees F. Coat 12 muffin cups with cooking spray.",
      "2": "Whisk eggs and brown sugar in a medium bowl until smooth. Whisk in bananas, buttermilk, wheat bran, oil and vanilla.",
      "3": "Whisk whole-wheat flour, all-purpose flour, baking powder, baking soda, cinnamon and salt in a large bowl. Make a well in the dry ingredients; add the wet ingredients and stir with a rubber spatula until just combined. Stir in chocolate chips, if using. Scoop the batter into the prepared muffin cups (they'll be quite full). Sprinkle with walnuts, if using.",
      "4": "Bake the muffins until the tops are golden brown and spring back when touched lightly, 15 to 25 minutes. Let cool in the pan for 5 minutes. Loosen edges and turn muffins out onto a wire rack to cool slightly before serving."
    },
    "pubTime": "2014-10-01",
    "serves": "12",
    "cookTime": "1 hr",
    "difficulty": "medium",
    "image": {
      "_url": "http://source.unsplash.com/_HhUMuuE0-k/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe002": {
    "categoryId": "1",
    "recipeId": "2",
    "categoryName": "breakfast",
    "name": "Savory French Toast with Smoked Salmon",
    "description": "French toast gets a savory dinnertime makeover by fusing two brunch favorites. Slices of crusty French bread are dunked in mustardy egg custard and topped with red onion, smoked salmon, dill and a simple caper-cream sauce.",
    "ingredients": [
      "2 cloves garlic, grated, divided",
      "½ cup crème fraîche or sour cream",
      "1 tablespoon capers, rinsed",
      "1 tablespoon chopped fresh dill, plus more for garnish",
      "1 tablespoon lemon juice",
      "½ teaspoon ground pepper, divided",
      "6 large eggs, divided",
      "½ cup whole milk",
      "½ teaspoon dry mustard",
      "4 (1/2 inch thick) slices crusty whole-wheat bread (about 8 ounces)",
      "2 tablespoons extra-virgin olive oil",
      "4 ounces sliced smoked salmon",
      "1 Thinly sliced red onion for garnish"
    ],
    "instructions": {
      "1": "Preheat oven to 250 degrees F.",
      "2": "Combine half the garlic, crème fraîche (or sour cream), capers, dill, lemon juice and 1/4 teaspoon pepper in a small bowl. Set aside.",
      "3": "Whisk 2 eggs, milk and dry mustard with the remaining garlic and 1/4 teaspoon pepper in a shallow dish.",
      "4": "Place 2 slices of bread in the custard and let sit for 30 seconds, flipping once halfway to coat evenly. Heat 1 tablespoon oil in a large nonstick or cast-iron skillet over medium-high heat. Add the soaked bread and cook, flipping once, until lightly browned and crispy, 1 to 2 minutes per side. Transfer to a baking sheet and keep warm in the oven. Repeat with the remaining 1 tablespoon oil and 2 slices of bread.",
      "5": "Meanwhile, poach or fry the remaining 4 eggs as desired.",
      "6": "Top the French toast with smoked salmon, the cooked eggs and the reserved sauce. Garnish with onion and more dill, if desired."
    },
    "pubTime": "2020-09-02",
    "serves": "4",
    "cookTime": "35 mins",
    "difficulty": "medium",
    "image": {
      "_url": "http://source.unsplash.com/60F2u88zT_E/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe003": {
    "categoryId": "1",
    "recipeId": "3",
    "categoryName": "breakfast",
    "name": "Overnight Quinoa Pudding",
    "description": "This quick and easy recipe blends quinoa and chia seeds for a protein-packed dessert or grab-and-go breakfast. This recipe uses kefir rather than milk for a probiotic boost and instead of refined sugar, this pudding relies on maple syrup for its sweetness. Prep time is minimal--just leave the mixture in the refrigerator overnight to firm up.",
    "ingredients": [
      "1 cup cooked and cooled quinoa",
      "¾ cup plain kefir",
      "1 tablespoon chia seeds, plus more for serving",
      "2 teaspoons pure maple syrup",
      "¼ teaspoon vanilla extract",
      "1 dash Dash of ground cinnamon",
      "1 cup Fresh berries for serving"
    ],
    "instructions": {
      "1": "Combine quinoa, kefir, chia seeds, maple syrup, vanilla and cinnamon in a bowl or jar. Refrigerate overnight. To serve, top with berries and more chia, if desired."
    },
    "pubTime": "2020-09-03",
    "serves": "1",
    "cookTime": "5 mins",
    "difficulty": "easy",
    "image": {
      "_url": "http://source.unsplash.com/GipVQ6G_ZJY/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe004": {
    "categoryId": "2",
    "recipeId": "4",
    "categoryName": "lunch",
    "name": "Baked Falafel Sandwiches",
    "description": "This street-style falafel sandwich is herbaceous, tangy and rich. The falafel gets nice and crispy in the oven while the veggies inside keep it simple and fresh. Make the tahini sauce (see Associated Recipes) ahead of time for easy prep. Wrapping the sandwich in foil makes it a perfect bring-along lunch and helps hold it together for eating on the go.",
    "ingredients": [
      "1 Cooking spray",
      "1 (15 ounce) can no-salt-added chickpeas, rinsed",
      "½ cup chopped fresh flat-leaf parsley",
      "½ cup chopped fresh cilantro",
      "½ cup grated red onion, plus 1 cup thinly sliced, divided",
      "¼ cup panko breadcrumbs",
      "1 tablespoon tahini",
      "1 teaspoon grated lemon zest",
      "2 tablespoons lemon juice, divided",
      "1 teaspoon ground cumin",
      "¼ teaspoon salt",
      "1 large clove garlic, grated",
      "1 cup thinly sliced English cucumber",
      "1 ½ tablespoons extra-virgin olive oil",
      "4 eaches (10-inch) whole-wheat wraps",
      "2 cups loosely packed arugula",
      "1 large tomato, cut into 8 slices",
      "1 recipe Tahini Sauce with Lemon & Garlic (see Associated Recipes)"
    ],
    "instructions": {
      "1": "Preheat oven to 350 degrees F. Line a baking sheet with foil; coat with cooking spray.",
      "2": "Pulse chickpeas, parsley, cilantro, grated onion, panko, tahini, lemon zest, 1 tablespoon lemon juice, cumin, salt and garlic in a food processor until a coarse meal forms, 10 to 12 pulses, stopping to scrape down the sides as needed. Shape the mixture into 4 (1/2-inch-thick) patties (about 1/2 cup each). Arrange the patties on the prepared baking sheet; coat tops with cooking spray. Bake for 10 minutes. Flip the patties; coat tops with cooking spray. Continue baking until golden brown, 10 to 12 minutes.",
      "3": "Meanwhile, combine sliced onion, cucumber, oil and the remaining 1 tablespoon lemon juice in a medium bowl. Let stand at room temperature, stirring occasionally, for about 20 minutes.",
      "4": "Remove the patties from the oven; let cool for 5 minutes. Cut in half.",
      "5": "Meanwhile, place wraps directly on oven racks; bake until just warmed through, about 1 minute.",
      "6": "Add arugula to the cucumber mixture; toss to combine. Place the warmed wraps on a work surface; top evenly with the arugula mixture, falafel halves, tomato slices and tahini sauce. Working with 1 wrap at a time, fold 1 side of the wrap over the center and roll up burrito-style. Wrap the bottom half with foil to hold the wrap together."
    },
    "pubTime": "2020-03-04",
    "serves": "4",
    "cookTime": "40 mins",
    "difficulty": "hard",
    "image": {
      "_url": "http://source.unsplash.com/50KffXbjIOg/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe005": {
    "categoryId": "2",
    "recipeId": "5",
    "categoryName": "lunch",
    "name": "Honey-Soy Broiled Salmon",
    "description": "A sweet, tangy and salty mixture of soy sauce, rice vinegar and honey does double-duty as marinade and sauce. Toasted sesame seeds provide a nutty and attractive accent. Make it a meal: Serve with brown rice and sautéed red peppers and zucchini slices.",
    "ingredients": [
      "1 scallion, minced",
      "2 tablespoons reduced-sodium soy sauce",
      "1 tablespoon rice vinegar",
      "1 tablespoon honey",
      "1 teaspoon minced fresh ginger",
      "1 pound center-cut salmon fillet, skinned and cut into 4 portions",
      "1 teaspoon toasted sesame seeds"
    ],
    "instructions": {
      "1": "Whisk scallion, soy sauce, vinegar, honey and ginger in a medium bowl until the honey is dissolved. Place salmon in a sealable plastic bag, add 3 tablespoons of the sauce and refrigerate; let marinate for 15 minutes. Reserve the remaining sauce.",
      "2": "Preheat broiler. Line a small baking pan with foil and coat with cooking spray.",
      "3": "Transfer the salmon to the pan, skinned-side down. (Discard the marinade.) Broil the salmon 4 to 6 inches from the heat source until cooked through, 6 to 10 minutes. Drizzle with the reserved sauce and garnish with sesame seeds."
    },
    "pubTime": "2006-08-05",
    "serves": "4",
    "cookTime": "40 mins",
    "difficulty": "medium",
    "image": {
      "_url": "http://source.unsplash.com/awj7sRviVXo/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe006": {
    "categoryId": "2",
    "recipeId": "6",
    "categoryName": "lunch",
    "name": "Roasted Cauliflower & Potato Curry Soup",
    "description": "In this healthy cauliflower soup recipe, roasting the cauliflower first adds depth and prevents the florets from turning to mush. A little tomato sauce and coconut milk give the broth a rich, silky texture. Serve with a dollop of sour cream or yogurt, if desired.",
    "ingredients": [
      "2 teaspoons ground coriander",
      "2 teaspoons ground cumin",
      "1 ½ teaspoons ground cinnamon",
      "1 ½ teaspoons ground turmeric",
      "1 ¼ teaspoons salt",
      "¾ teaspoon ground pepper",
      "⅛ teaspoon cayenne pepper",
      "1 small head cauliflower, cut into small florets (about 6 cups)",
      "2 tablespoons extra-virgin olive oil, divided",
      "1 large onion, chopped",
      "1 cup diced carrot",
      "3 large cloves garlic, minced",
      "1 ½ teaspoons grated fresh ginger",
      "1 fresh red chile pepper, such as serrano or jalapeño, minced, plus more for garnish",
      "1 (14 ounce) can no-salt-added tomato sauce ",
      "4 cups low-sodium vegetable broth",
      "3 cups diced peeled russet potatoes (1/2-inch)",
      "3 cups diced peeled sweet potatoes (1/2-inch)",
      "2 teaspoons lime zest",
      "2 tablespoons lime juice",
      "1 (14 ounce) can coconut milk",
      "1 tablespoon Chopped fresh cilantro for garnish"
    ],
    "instructions": {
      "1": "Preheat oven to 450 degrees F.",
      "2": "Combine coriander, cumin, cinnamon, turmeric, salt, pepper and cayenne in a small bowl. Toss cauliflower with 1 tablespoon oil in a large bowl, sprinkle with 1 tablespoon of the spice mixture and toss again. Spread in a single layer on a rimmed baking sheet. Roast the cauliflower until the edges are browned, 15 to 20 minutes. Set aside.",
      "3": "Meanwhile, heat the remaining 1 tablespoon oil in a large pot over medium-high heat. Add onion and carrot and cook, stirring often, until starting to brown, 3 to 4 minutes. Reduce heat to medium and continue cooking, stirring often, until the onion is soft, 3 to 4 minutes. Add garlic, ginger, chile and the remaining spice mixture. Cook, stirring, for 1 minute more.",
      "4": "Stir in tomato sauce, scraping up any browned bits, and simmer for 1 minute. Add broth, potatoes, sweet potatoes, lime zest and juice. Cover and bring to a boil over high heat. Reduce heat to maintain a gentle simmer and cook, partially covered and stirring occasionally, until the vegetables are tender, 35 to 40 minutes.",
      "5": "Stir in coconut milk and the roasted cauliflower. Return to a simmer to heat through. Serve garnished with cilantro and chiles, if desired."

    },
    "pubTime": "2018-06-06",
    "serves": "8",
    "cookTime": "1 hrs 30 mins",
    "difficulty": "hard",
    "image": {
      "_url": "http://source.unsplash.com/ZN-TT10kf4o/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe007": {
    "categoryId": "3",
    "recipeId": "7",
    "categoryName": "dinner",
    "name": "Chicken Piccata with Pasta & Mushrooms",
    "description": "Our chicken piccata, served over whole-wheat pasta, has a rich lemon-caper sauce that's made with extra-virgin olive oil and just a touch of butter for flavor. If you like, you can use a mild fish like tilapia or even shrimp instead of chicken breast.",
    "ingredients": [
      "3 teaspoons extra-virgin olive oil, divided",
      "1 (10 ounce) package 1/3 cup all-purpose flour, divided",
      "3 large 2 cups reduced-sodium chicken broth",
      "½ cup white wine",
      "2 tablespoons lemon juice",
      "¼ cup chopped fresh parsley ",
      "2 tablespoons capers, rinsed",
      "2 teaspoons butter",
      "6 ounces whole-wheat angel hair pasta",
      "⅓ cup 1/2 teaspoon salt, divided",
      "2 cups 1/4 teaspoon freshly ground pepper",
      "½ teaspoon 4 chicken cutlets, (3/4-1 pound total), trimmed",
      "¼ teaspoon 3 large cloves garlic, minced",
      "4 eaches 1 10-ounce package mushrooms, sliced"
    ],
    "instructions": {
      "1": "Bring a large pot of water to a boil. Add pasta and cook until just tender, 4 to 6 minutes or according to package directions. Drain and rinse.",
      "2": "Meanwhile, whisk 5 teaspoons flour and broth in a small bowl until smooth. Place the remaining flour in a shallow dish. Season chicken with 1/4 teaspoon salt and pepper and dredge both sides in the flour. Heat 2 teaspoons oil in a large nonstick skillet over medium heat. Add the chicken and cook until browned and no longer pink in the middle, 2 to 3 minutes per side. Transfer to a plate; cover and keep warm.",
      "3": "Heat the remaining 1 teaspoon oil in the pan over medium-high heat. Add mushrooms and cook, stirring, until they release their juices and begin to brown, about 5 minutes. Transfer to a plate. Add garlic and wine to the pan and cook until reduced by half, 1 to 2 minutes. Stir in the reserved broth-flour mixture, lemon juice and the remaining 1/4 teaspoon salt. Bring to a simmer and cook, stirring, until the sauce is thickened, about 5 minutes.",
      "4": "Stir in parsley, capers, butter and the reserved mushrooms. Measure out 1/2 cup of the mushroom sauce. Toss the pasta in the pan with the remaining sauce. Serve the pasta topped with the chicken and the reserved sauce."
    },
    "pubTime": "2008-02-07",
    "serves": "4",
    "cookTime": "40 mins",
    "difficulty": "medium",
    "image": {
      "_url": "http://source.unsplash.com/t8hTmte4O_g/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe008": {
    "categoryId": "3",
    "recipeId": "8",
    "categoryName": "dinner",
    "name": "Charred Shrimp & Pesto Buddha Bowls",
    "description": "These shrimp and pesto Buddha bowls are delicious, healthy, pretty and take less than 30 minutes to prep. In other words, they're basically the ultimate easy weeknight dinner. Feel free to add additional vegetables and swap the shrimp for chicken, steak, tofu or edamame.",
    "ingredients": [
      "⅓ cup prepared pesto",
      "2 tablespoons balsamic vinegar",
      "1 tablespoon extra-virgin olive oil",
      "½ teaspoon salt",
      "¼ teaspoon ground pepper",
      "1 pound peeled and deveined large shrimp (16-20 count), patted dry ",
      "4 cups arugula",
      "2 cups cooked quinoa",
      "1 cup halved cherry tomatoes",
      "1 avocado, diced"
    ],
    "instructions": {
      "1": "Whisk pesto, vinegar, oil, salt and pepper in a large bowl. Remove 4 tablespoons of the mixture to a small bowl; set both bowls aside.",
      "2": "Heat a large cast-iron skillet over medium-high heat. Add shrimp and cook, stirring, until just cooked through with a slight char, 4 to 5 minutes. Remove to a plate.",
      "3": "Add arugula and quinoa to the large bowl with the vinaigrette and toss to coat. Divide the arugula mixture between 4 bowls. Top with tomatoes, avocado and shrimp. Drizzle each bowl with 1 tablespoon of the reserved pesto mixture."
    },
    "pubTime": "2019-06-08",
    "serves": "4",
    "cookTime": "25 mins",
    "difficulty": "easy",
    "image": {
      "_url": "http://source.unsplash.com/w_z0RJCSBiE/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe009": {
    "categoryId": "3",
    "recipeId": "9",
    "categoryName": "dinner",
    "name": "Pork Shoulder Steaks With Horseradish-Mustard Sauce",
    "description": "Sometimes the best meat in the butcher’s case isn’t beef. Pork shoulder is virtually guaranteed to be pleasantly fatty and flavorful.",
    "ingredients": [
      "2 tbsp finely grated peeled horseradish or 1 Tbsp (packed) drained prepared horseradish",
      "2 tbsp Dijon mustard",
      "1 tbsp whole grain mustard",
      "1 tsp honey",
      "Kosher salt",
      "1 toasted nori sheet (optional)",
      "1 tbsp ground coriander",
      "1 tbsp mustard powder",
      "2 tsp light brown sugar",
      "1 tsp freshly ground black pepper",
      "1 tsp garlic powder",
      "Vegetable oil (for grill)",
      "4 (¾ thick) pork shoulder steaks (1½–2 lb.)"
    ],
    "instructions": {
      "1": "Sauce: Mix horseradish, both mustards, and honey in a small bowl to combine; season with salt.",
      "2": "Steak and assembly: If using nori, finely grind in a spice mill or mortar and pestle. Mix coriander, mustard powder, brown sugar, pepper, garlic powder, and half of nori powder (if using) in a small bowl. This is your dry rub. Set remaining nori powder aside for serving.",
      "3": "Prepare a grill for medium-high heat; oil grate. Season steaks generously with salt. Sprinkle generously all over with dry rub. Grill, turning every 1–2 minutes, until lightly charred and an instant-read thermometer inserted into the thickest part of pork registers 140°F, 7–9 minutes. Transfer to a cutting board and let rest 5–10 minutes before thinly slicing.",
      "4": "Spread mustard sauce onto plates and arrange pork over. Top with horseradish and sprinkle with reserved nori powder."
    },
    "pubTime": "2020-07-09",
    "serves": "4",
    "cookTime": "50 mins",
    "difficulty": "medium",
    "image": {
      "_url": "http://source.unsplash.com/62wwTrz0Gbc/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe010": {
    "categoryId": "4",
    "recipeId": "10",
    "categoryName": "desserts",
    "name": "Blueberry-Swirl Buttermilk Ice Cream",
    "description": "This gorgeous homemade ice cream is a showstopper, thanks to bold swirls of blueberry syrup that cut through tart buttermilk-yogurt cream.",
    "ingredients": [
      "2 large eggs large eggs",
      "½ cup sugar plus 1/4 cup, divided",
      "¼ teaspoon salt",
      "1 cup buttermilk ",
      "2 cups whole-milk plain Greek yogurt ",
      "1 (12 ounce) package frozen unsweetened blueberries ",
      "2 tablespoons lemon juice",
      "¼ cup Blueberries & mint for garnish"
    ],
    "instructions": {
      "1": "Whisk eggs, 1/2 cup sugar, and salt in a heavy saucepan until slightly thick. Whisk in buttermilk. Cook over medium-low heat, stirring constantly, until the mixture coats a metal spoon and reaches 165 degrees F, about 10 minutes. Set the pan in a bowl of ice water and stir until cooled. Stir in yogurt. Refrigerate for 8 to 24 hours.",
      "2": "Meanwhile, combine blueberries, the remaining 1/4 cup sugar, and lemon juice in a small saucepan. Bring to a boil over medium-high heat, whisking frequently. Reduce heat and simmer until syrupy, about 5 minutes. Let cool. Transfer to a bowl and refrigerate for 8 to 24 hours.",
      "3": "Freeze the chilled buttermilk mixture in a 1 1/2- or 2-qt. ice cream maker according to manufacturer's directions. Transfer to a freezer container. Swirl in the blueberry mixture. Freeze until firm, 6 to 8 hours.",
      "4": "Let stand at room temperature for 20 to 30 minutes before serving. Garnish with fresh blueberries and mint, if desired."
    },
    "pubTime": "2018-05-10",
    "serves": "12",
    "cookTime": "15 hrs",
    "difficulty": "medium",
    "image": {
      "_url": "http://source.unsplash.com/8beTH4VkhLI/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe011": {
    "categoryId": "4",
    "recipeId": "11",
    "categoryName": "desserts",
    "name": "Bev's Chocolate Chip Cookies",
    "description": "EatingWell reader Beverley Sharpe of Santa Barbara, California, contributed this healthy chocolate chip cookie recipe. She gave chocolate chip cookies a healthy update by cutting back on sugar and incorporating whole grains. To increase protein, Sharpe replaces the rolled oats with 1 cup almond meal.",
    "ingredients": [
      "¾ cup rolled oats",
      "1 cup whole-wheat flour",
      "½ teaspoon baking soda",
      "½ teaspoon salt",
      "¼ cup butter, softened",
      "¼ cup canola oil",
      "⅓ cup granulated sugar",
      "⅓ cup brown sugar",
      "1 large egg",
      "1 teaspoon vanilla extract",
      "1 cup chocolate chips"
    ],
    "instructions": {
      "1": "Preheat oven to 350 degrees F. Coat 2 baking sheets with cooking spray.",
      "2": "Grind oats in a blender or food processor. Transfer to a medium bowl and stir in flour, baking soda and salt. Beat butter in a large bowl with an electric mixer until fluffy. Add oil, granulated sugar, brown sugar, egg and vanilla; beat until smooth and creamy. With the mixer running, add the dry ingredients, beating on low speed until just combined. Stir in chocolate chips.",
      "3": "Drop the dough by heaping teaspoonfuls, at least 1 inch apart, onto the prepared baking sheets. Bake cookies, 1 sheet at a time, until firm around the edges and golden on top, about 15 minutes. Cool the cookies for 2 minutes on the baking sheets, then transfer to wire racks to cool completely."
    },
    "pubTime": "2012-08-11",
    "serves": "30",
    "cookTime": "35 mins",
    "difficulty": "medium",
    "image": {
      "_url": "http://source.unsplash.com/hswvkbFJO9w/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe012": {
    "categoryId": "4",
    "recipeId": "12",
    "categoryName": "desserts",
    "name": "Unicorn Cupcakes",
    "description": "Turn an easy vanilla cupcake recipe into an impressive mythical creature with just a couple marshmallows, a dash of sprinkles and a perfectly placed candle. Kids will flip for these unicorn treats, and you'll flip over how easy and quick they are to decorate. A birthday party win for kids and adults alike!",
    "ingredients": [
      "Cupcakes",
      "¾ cup all-purpose flour",
      "¾ cup white whole-wheat flour",
      "1 ½ teaspoons baking powder",
      "½ teaspoon salt",
      "1 cup granulated sugar",
      "½ cup unsalted butter or coconut oil, softened",
      "2 large eggs large eggs",
      "2 teaspoons vanilla extract",
      "½ cup buttermilk",
      "Frosting",
      "12 ounces reduced-fat cream cheese",
      "½ cup confectioners' sugar ",
      "3 tablespoons plain Greek yogurt",
      "½ teaspoon vanilla extract",
      "Decorations",
      "¼ cup Naturally dyed pink sanding sugar",
      "12 eaches mini marshmallows",
      "3 tablespoons Naturally dyed sprinkles"
    ],
    "instructions": {
      "1": "To prepare cupcakes: Preheat oven to 350 degrees F. Line 12 (1/2-cup) muffin cups with paper liners.",
      "2": "Whisk all-purpose flour, whole-wheat flour, baking powder and salt in a medium bowl.",
      "3": "Beat granulated sugar and butter (or coconut oil) in a large mixing bowl with an electric mixer on medium speed until creamy. Add eggs and 2 teaspoons vanilla; beat until blended. With the mixer on low, alternately mix in the dry ingredients and buttermilk, starting and ending with the dry ingredients and scraping the sides of the bowl as needed, until just combined. Divide the batter among the prepared cups.",
      "4": "Bake the cupcakes until a toothpick inserted into the center comes out clean, 20 to 22 minutes. Let cool in the pan for 10 minutes. Turn the cupcakes out onto a rack to cool completely.",
      "5": "Meanwhile, prepare frosting: Combine cream cheese, confectioners' sugar, yogurt and vanilla in a mixing bowl. Beat with an electric mixer until smooth. Cover and refrigerate until cold, about 30 minutes.",
      "6": "To decorate the cupcakes: Place a few tablespoons of sanding sugar on a plate. Halve each marshmallow on the diagonal, then press the cut side in the sugar to coat. Set aside.",
      "7": "Place the frosting in a decorating bag fitted with a large star tip. Pipe a few swirls of frosting on each cupcake. Press two marshmallow \"ears\" in place. Decorate with sprinkles and finish with a candle between the marshmallow \"ears.\" Refrigerate until ready to serve."
    },
    "pubTime": "2018-01-12",
    "serves": "12",
    "cookTime": "1 hr 45 mins",
    "difficulty": "hard",
    "image": {
      "_url": "http://source.unsplash.com/amzu0PX4h1E/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe013": {
    "categoryId": "5",
    "recipeId": "13",
    "categoryName": "drinks",
    "name": "Mojito Mocktails",
    "description": "These minty mojito mocktails would be great at a luncheon, a brunch, a baby shower, a pool party--basically whenever you find that a cool, refreshing beverage would be welcome. Be sure to add the ice cubes and sparkling water just before serving to avoid diluting this pitcher cocktail (which is easily doubled to serve a crowd, by the way).",
    "ingredients": [
      "¾ cup fresh lime juice (from 6 limes) ",
      "¾ cup simple syrup",
      "½ cup packed fresh mint leaves",
      "2 strip (blank)s (2-inch) strips lime zest",
      "4 cups ice cubes",
      "2 cups sparkling water",
      "4 slice (1/4\" thick) (blank)s Lime slices and mint sprigs, for garnish"
    ],
    "instructions": {
      "1": "Combine lime juice, simple syrup, mint leaves and lime zest in a pitcher; using the handle of a long wooden spoon, lightly crush the mint and zest. Add ice cubes and sparkling water; stir to mix well. Divide among 4 glasses; garnish with lime slices and mint sprigs, if desired."
    },
    "pubTime": "2019-04-12",
    "serves": "4",
    "cookTime": "10 mins",
    "difficulty": "easy",
    "image": {
      "_url": "http://source.unsplash.com/YNMjGIPgD_c/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe014": {
    "categoryId": "5",
    "recipeId": "14",
    "categoryName": "drinks",
    "name": "Fruit & Yogurt Smoothie",
    "description": "This easy fruit smoothie with yogurt recipe calls for just three ingredients--yogurt, fruit juice and whatever frozen fruit you have on hand. Mix up your combinations from day to day for a healthy breakfast or snack you'll never get bored with.",
    "ingredients": [
      "1 cup 3/4 cup nonfat plain yogurt",
      "¼ cup 1/2 cup 100% pure fruit juice ",
      "1 ½ cups 1 1/2 cups (6 1/2 ounces) frozen fruit, such as blueberries, raspberries, pineapple or peaches"
    ],
    "instructions": {
      "1": "Puree yogurt with juice in a blender until smooth. With the motor running, add fruit through the hole in the lid and continue to puree until smooth."
    },
    "pubTime": "2020-11-01",
    "serves": "1",
    "cookTime": "10 mins",
    "difficulty": "easy",
    "image": {
      "_url": "http://source.unsplash.com/CpBBsda2eRI/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe015": {
    "categoryId": "5",
    "recipeId": "15",
    "categoryName": "drinks",
    "name": "Whipped Coffee Mochaccino",
    "description": "If you love the whipped coffee trend that's taken the internet by storm, you'll love this mochaccino version of the beverage. Use any milk you like, including any flavored nondairy milks, and stir it together before drinking to enhance the mocha taste of the drink. This version is lower in sugar than the standard whipped coffee, but feel free to add 1 extra tablespoon sugar if it's not sweet enough for you.",
    "ingredients": [
      "1 cup milk (regular or nondairy; see Tip), divided",
      "¼ cup instant coffee ",
      "3 tablespoons granulated sugar",
      "1 teaspoon cocoa powder",
      "¼ cup boiling water"
    ],
    "instructions": {
      "1": "Divide milk between two 8- to 12-ounce glasses and set aside.",
      "2": "Whisk coffee, granulated sugar and cocoa powder together in a large heatproof bowl.",
      "3": "Pour boiling water into the coffee mixture.",
      "4": "With an electric mixer, beat the mixture until it's thickened and very fluffy, about 3 minutes. (Alternatively, you can use a stand mixer or a whisk-whisk as fast as you can.)",
      "5": "Divide the whipped coffee mixture between the 2 glasses. Stir before drinking to combine the milk and the coffee."
    },
    "pubTime": "2020-04-15",
    "serves": "2",
    "cookTime": "5 mins",
    "difficulty": "easy",
    "image": {
      "_url": "http://source.unsplash.com/Y13NFX4aEMY/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe016": {
    "categoryId": "6",
    "recipeId": "16",
    "categoryName": "holidays",
    "name": "Perfect Prime Rib",
    "description": "Cooking prime rib can be intimidating--it's such a big piece of meat and you're usually making it for a special occasion, like Christmas or a formal dinner, so you want to get it just right. But it needn't be stressful: This easy prime rib recipe calls for just a handful of ingredients and lays out how to cook prime rib so it's juicy, tender and full of flavor, without a lot of fuss.",
    "ingredients": [
      "4 large garlic cloves, finely chopped (1 1/2 tablespoons)",
      "1 tablespoon kosher salt, divided",
      "1 tablespoon fresh thyme leaves",
      "1 teaspoon finely chopped fresh rosemary",
      "1 ½ teaspoons ground pepper",
      "3 tablespoons olive oil",
      "1 (5 pound) 3-rib beef standing rib roast, chine bone removed"
    ],
    "instructions": {
      "1": "Line a rimmed baking sheet with foil; set a wire rack in the pan. Place garlic on a cutting board and sprinkle with 1 teaspoon salt. Drag the flat side of a large knife back and forth over the garlic to form a paste. Transfer the paste to a small bowl. Add thyme, rosemary, pepper, oil and the remaining 2 teaspoons salt; stir until thoroughly blended.",
      "2": "Rub the garlic mixture evenly over roast. Place the roast, fat cap up, on the prepared rack on the pan. Refrigerate, uncovered, for 8 hours or overnight.",
      "3": "Remove the roast from the refrigerator 1 hour before cooking; let stand at room temperature.",
      "4": "Place oven rack in lower third of oven; preheat to 275 degrees F.",
      "5": "Roast the prime rib until a thermometer inserted in the thickest portion registers 120 degrees F (for medium-rare), about 2 hours and 30 minutes to 2 hours and 50 minutes, or to 130 degrees F (for medium). Remove from the oven and let rest for 1 hour before serving."
    },
    "pubTime": "2019-10-16",
    "serves": "14",
    "cookTime": "12 hrs 45 mins",
    "difficulty": "medium",
    "image": {
      "_url": "http://source.unsplash.com/UeYkqQh4PoI/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe017": {
    "categoryId": "6",
    "recipeId": "17",
    "categoryName": "holidays",
    "name": "Broiled Lobster Tails",
    "description": "This easy holiday appetizer calls for lobster tails, the meatiest part of the lobster, which you can buy fresh or frozen. We've also included three easy and delicious compound butters to choose from to pair with the lobster meat: this recipe makes classic lobster thermidor butter, with the rich mix of Parmesan cheese, herbs and brandy;see Tips (below) to swap in an earthy porcini mushroom butter or a bright fennel and lemon butter.",
    "ingredients": [
      "8 eaches lobster tails (7 ounces each), thawed if frozen", 
      "6 tablespoons unsalted butter, softened",
      "¼ cup grated Parmesan cheese",
      "2 tablespoons finely chopped shallot",
      "1 tablespoon finely chopped fresh tarragon",
      "1 tablespoon brandy or cognac",
      "1 teaspoon grated garlic",
      "1 teaspoon Dijon mustard"
    ],
    "instructions": {
      "1": "Place rack in top third of oven. Preheat broiler to low. Line a rimmed baking sheet with foil. Using kitchen shears, cut along the length of each lobster tail shell; do not cut through wide end of tail. Using a knife, make a shallow cut in the meat, leaving the fan intact. Remove the vein running through the tail. (If needed, rinse the lobster tails under cold running water. Drain and pat dry with paper towels.) Using your fingers, loosen the meat from the shells, but do not remove. Place the tails on the prepared baking sheet.",
      "2": "Combine butter, Parmesan, shallot, tarragon, brandy (or cognac), garlic and mustard in a small bowl. Mash with a fork until well combined and the brandy (or cognac) is absorbed into the mixture. (Or see Variations, below). Divide the butter mixture equally among the lobster tails, spreading it evenly over the lobster meat.",
      "3": "Broil the tails until the lobster meat is plump, opaque and pulling away from the sides of the shells, 6 to 8 minutes. Transfer the tails to a serving platter. Spoon any melted butter from the baking sheet over the tails."
    },
    "pubTime": "2019-11-27",
    "serves": "8",
    "cookTime": "25 mins",
    "difficulty": "medium",
    "image": {
      "_url": "http://source.unsplash.com/TbgRGRSwlNo/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe018": {
    "categoryId": "6",
    "recipeId": "18",
    "categoryName": "holidays",
    "name": "Spritz Cookies",
    "description": "It's time to break out your spritz cookie press for these festive Christmas spritz cookies! These easy Christmas cookies can be decorated with sprinkles or flavored with citrus, spices or sweet sugar glaze. And if you're looking for healthy cookies, these fit the bill thanks to whole-wheat pastry flour that keeps their texture soft while giving them a boost of fiber. For ideas on how to dress up these spritz cookies even more with different flavorings or a glaze, see Tips below.",
    "ingredients": [
      "1 cup (2 sticks) unsalted butter, softened ",
      "⅔ cup sugar",
      "1 large egg",
      "½ teaspoon vanilla extract",
      "¼ teaspoon almond extract",
      "1 ¼ cups whole-wheat pastry flour",
      "1 cup all-purpose flour",
      "¼ teaspoon baking powder",
      "¼ teaspoon salt",
      "1 tablespoon Assorted sprinkles or sanding sugar"
    ],
    "instructions": {
      "1": "Position rack in middle of oven; preheat to 375 degrees F. Line 2 baking sheets with parchment paper. Beat butter and sugar in a large bowl with an electric mixer on medium speed until creamy. Add egg and vanilla and almond extracts, beating until blended.",
      "2": "Combine whole-wheat flour, all-purpose flour, baking powder and salt in a medium bowl; add to butter mixture gradually, beating on low speed until blended. Cover and refrigerate for 30 minutes.",
      "3": "Press the dough into desired shapes, using a cookie press according to manufacturer's instructions. Place the cookies 1 inch apart on the prepared baking sheets. (Keep the remaining dough covered and refrigerated until ready to use.) Decorate with sprinkles (or sanding sugar), if desired.",
      "4": "Bake the cookies, one sheet at a time, until just set and lightly browned around edges, 9 to 10 minutes. Let cool for 3 minutes on the pan, then transfer to wire racks to cool completely, about 20 minutes. Repeat with the remaining dough."
    },
    "pubTime": "2019-11-18",
    "serves": "24",
    "cookTime": "1 hr 45 mins",
    "difficulty": "medium",
    "image": {
      "_url": "http://source.unsplash.com/yuAEcsAe4lk/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe019": {
    "categoryId": "6",
    "recipeId": "19",
    "categoryName": "holidays",
    "name": "Beet & Goat Cheese Salad",
    "description": "This stunning winter salad gets its sweet, earthy flavor from roasted beets and balsamic vinegar. Creamy goat cheese and peppery arugula add color and balance, while toasted walnuts add crunch. A mandoline is the best way to get thin, even slices from the roasted beets.",
    "ingredients": [
      "1 pound red beets, trimmed",
      "1 cup balsamic vinegar, divided",
      "2 cups loosely packed arugula",
      "1 tablespoon extra-virgin olive oil",
      "¼ teaspoon salt ",
      "¼ teaspoon ground pepper",
      "2 ounces goat cheese, crumbled (about 1/2 cup)",
      "¼ cup chopped toasted walnuts "
          ],
    "instructions": {
      "1": "Preheat oven to 400 degrees F. Place a large piece of foil on a rimmed baking sheet; place beets in the center of the foil. Gather the sides of the foil up to make a packet; pour in 1/2 cup vinegar and seal the packet. Roast until the beets are very tender when pierced with a knife, about 45 minutes. Open the foil packet; let cool for 30 minutes.",
      "2": "Meanwhile, bring the remaining 1/2 cup vinegar to a boil in a small saucepan over medium-high heat. Cook, without stirring, until reduced to about 3 tablespoons, about 10 minutes. Remove from heat (the mixture will thicken as it cools).",
      "3": "When the beets are cool enough to handle, peel them, then slice very thinly with a knife or a mandoline. Arrange the sliced beets, overlapping slightly, on a platter.",
      "4": "Toss arugula with oil, salt and pepper in a medium bowl; arrange on top of the beets. Sprinkle with goat cheese and walnuts; drizzle with the balsamic reduction."
    },
    "pubTime": "2019-11-20",
    "serves": "4",
    "cookTime": "1 hr 35 mins",
    "difficulty": "easy",
    "image": {
      "_url": "http://source.unsplash.com/MlPD-AzZYMg/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe020": {
    "categoryId": "6",
    "recipeId": "20",
    "categoryName": "holidays",
    "name": "Prosciutto-Wrapped Scallops with Spinach",
    "description": "This take on the classic bacon-wrapped appetizer uses prosciutto instead to wrap meaty scallops. High-quality Italian prosciutto, found at well-stocked supermarkets or Italian specialty stores, has an incomparable melt-in-your-mouth texture. It's more expensive, but you only need a little for this recipe. Make it a meal: Serve with an unoaked chardonnay and our recipe for Wild Rice Salad or whole-wheat orzo tossed with Parmesan cheese.",
    "ingredients": [
      "12 eaches 12 large dry sea scallops, (about 1 pound)",
      "¼ teaspoon lemon pepper",
      "1 ¼ ounces 1 1/4 ounces very thinly sliced prosciutto, (about 3 slices), cut into 12 long strips",
      "3 tablespoons extra-virgin olive oil",
      "1 teaspoon freshly grated lemon zest",
      "1 tablespoon lemon juice",
      "¼ teaspoon salt",
      "1 Freshly ground pepper, to taste ",
      "12 ounces baby spinach"
    ],
    "instructions": {
      "1": "Place rack in upper third of oven; preheat broiler. Coat a large baking sheet with cooking spray.",
      "2": "Pat scallops dry and sprinkle both sides with lemon pepper. Wrap 1 piece of prosciutto around each scallop. Thread 3 scallops crosswise onto each skewer (securing the prosciutto to the scallop) and place on the prepared baking sheet. Broil until just cooked through, about 6 minutes.",
      "3": "Meanwhile, whisk oil, lemon zest, lemon juice, salt and pepper in a medium bowl. Reserve 1 tablespoon vinaigrette in a small bowl.",
      "4": "Place spinach in a colander and rinse under cold water. Heat a large skillet over medium heat. When hot, add handfuls of spinach (with water still clinging to it) to the pan and cook, stirring, until just wilted, 2 to 3 minutes. Drain the spinach and add to the medium bowl; toss to coat with the vinaigrette. Divide the spinach among 4 plates and top each portion with 3 scallops. Drizzle the scallops with the reserved vinaigrette."
    },
    "pubTime": "2019-11-18",
    "serves": "4",
    "cookTime": "30 mins",
    "difficulty": "easy",
    "image": {
      "_url": "http://source.unsplash.com/19Ft3QfakMo/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  },
  "recipe021": {
    "categoryId": "6",
    "recipeId": "21",
    "categoryName": "holidays",
    "name": "Peppermint Hot Cocoa Mix",
    "description": "Put together this tasty Peppermint Hot Cocoa mix in a festive jar for a stocking stuffer or fun holiday gift.",
    "ingredients": [
      "3 cups nonfat dry milk powder",
      "½ cup unsweetened cocoa powder",
      "¾ cup sugar or sugar substitute equivalent to 3/4 cup sugar",
      "½ cup crushed peppermint candies (3 ounces)"
    ],
    "instructions": {
      "1": "In a large bowl, stir together milk powder, cocoa powder, and sugar. Divide among five decorative containers. Top with crushed candies. Seal and label containers. Store at room temperature for up to 3 months.",
      "2": "To serve, shake contents of the container. For each serving, place 3 tablespoons of the mix in a 10-ounce mug and add 1 cup boiling water; stir until mix is well incorporated (crushed candies will dissolve in about 2 minutes as the mixture stands)."
    },
    "pubTime": "2020-10-12",
    "serves": "20",
    "cookTime": "10 mins",
    "difficulty": "easy",
    "image": {
      "_url": "http://source.unsplash.com/_Ugmcgbns4s/750x1000",
      "_height": "1000",
      "_width": "750"
    }
  }
}